---
title: LineSegment
classe: Autodesk.Revit.DB.LineSegment
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# LineSegment

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double EndParameter { get; }` | `lineSegment.EndParameter` | Double |
| `XYZ EndPoint { get; }` | `lineSegment.EndPoint` | XYZ |
| `Boolean IsValidObject { get; }` | `lineSegment.IsValidObject` | Boolean |
| `LineProperties LineProperties { get; }` | `lineSegment.LineProperties` | LineProperties |
| `Double StartParameter { get; }` | `lineSegment.StartParameter` | Double |
| `XYZ StartPoint { get; }` | `lineSegment.StartPoint` | XYZ |
| `Void Dispose()` | `lineSegment.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```